// Выполняет длительную операцию с раздельной подготовкой запроса и контекста.
Процедура ВыполнитьДлительнуюОперацию(Параметры, АдресРезультата) Экспорт

	ПроверитьПараметры(Параметры);
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Контекст = Новый Структура(
		"АктивныеЗадания, Результат, ИдентификаторГлавногоЗадания",
		Новый Массив,
		НовыйРезультат(),
		ИдентификаторГлавногоЗадания()
	);

	ХранилищеТаблиц = Новый МенеджерВременныхТаблиц;

	Попытка

		ДлительныеОперации.СообщитьПрогресс(0, "Поиск дубликатов и проверка документов и операций...");

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ХранилищеТаблиц;
		Запрос.Текст                   = ПолучитьМакет("ОтборДубликатов").ПолучитьТекст();
		Запрос.УстановитьПараметр("ДатаОкончания", Параметры.ДатаОкончания);

		Отбор         = Запрос.Выполнить();
		ВыборкаОтбора = Отбор.Выбрать();

		Контекст.Вставить("Всего"                    , ВыборкаОтбора.Количество());
		Контекст.Вставить("Выборка"                  , ВыборкаОтбора);
		Контекст.Вставить("ВсеПорцииВыданы"          , Ложь);
		Контекст.Вставить("НомерПорции"              , 0);
		Контекст.Вставить("ВремяПоследнегоОповещения", 0);
		Контекст.Вставить("ПоследнийПроцент"         , -1);

		ВыполнитьВНесколькоПотоков(Контекст, Параметры, ХранилищеТаблиц);
		ХранилищеТаблиц.Закрыть();
		Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000;
		ПоместитьВоВременноеХранилище(ПредставлениеРезультата(Контекст, Длительность), АдресРезультата);

	Исключение

		ОстановитьПотоки(Контекст);
		ХранилищеТаблиц.Закрыть();
		ВызватьИсключение;

	КонецПопытки;

КонецПроцедуры
